###################################################
# brew bundle --file=~/.dots/dots/homebrew/Brewfile
###################################################

# Taps
tap "caskroom/cask"
tap "homebrew/apache"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/php"
tap "homebrew/science"
tap "homebrew/services"
tap "homebrew/versions"


# Build tools
brew "cmake"


# Version Control
brew "git"
brew "subversion"


# Libraries
brew "msgpack"
brew "libxml2"
brew "libyaml"
brew "openssl"


# Languages
# brew "php56"
# brew "php70"
brew "python"
brew "node"


# Tools
brew "vim"
brew "wget"
brew "tidy-html5"
brew "redis"
brew "homebrew/apache/httpd24"
brew "mysql"
brew "wp-cli"


# General Apps
cask "slack"
cask "google-chrome"
cask "google-drive"
cask "1password"
cask "dropbox"
cask "iterm2"
cask "sketch"
cask "macdown"


# Utilities
brew "cmatrix"
brew "cowsay"
brew "fortune"
brew "coreutils"
brew "p7zip"
brew "ruby-build"
brew "rbenv"
