###################################################
# brew bundle --file=~/.dots/homebrew/Brewfile
###################################################

tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "macvim-dev/macvim"

brew "ack"
brew "advancecomp"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aspell"
brew "autoconf"
brew "automake"
brew "bash-completion"
brew "bcrypt"
brew "ccrypt"
brew "clamav"
brew "cmake"
brew "cmatrix"
brew "composer"
brew "coreutils"
brew "cowsay"
brew "cscope"
brew "fortune"
brew "gcc"
brew "gd"
brew "gettext", link: true
brew "git"
brew "git-extras"
brew "gnu-sed"
brew "htop"
brew "httpd"
brew "hub"
brew "hubflow"
brew "imagemagick"
brew "jpeg"
brew "jpegoptim"
brew "libev"
brew "libevent"
brew "libffi"
brew "libgpg-error"
brew "libidn2"
brew "libksba"
brew "libmpc"
brew "libpng"
brew "libpq"
brew "libsodium"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libuv"
brew "libvterm"
brew "libxml2"
brew "libyaml"
brew "libzip"
brew "little-cms2"
brew "lnav"
brew "lorem"
brew "luajit"
brew "lynx"
brew "macvim"
brew "mas"
brew "mcrypt"
brew "memcached"
brew "mhash"
brew "mpfr"
brew "msgpack"
brew "mysql", restart_service: true
brew "neon"
brew "nghttp2"
brew "nmap"
brew "node", link: false
brew "openssl"
brew "openssl@1.1"
brew "optipng"
brew "p7zip"
brew "pandoc"
brew "par"
brew "pcre"
brew "perl"
brew "phantomjs"
brew "php-code-sniffer"
brew "php-cs-fixer"
brew "php@7.0", args: ['with-http2'], link: false
#brew "php70-igbinary", args: ['build-from-source']
#brew "php70-opcache", args: ['build-from-source']
#brew "php70-redis", args: ['build-from-source']
#brew "php70-xdebug", args: ['build-from-source']
brew "php@7.1", args: ['with-http2']
#brew "php71-igbinary", args: ['build-from-source']
#brew "php71-opcache", args: ['build-from-source']
#brew "php71-redis", args: ['build-from-source']
#brew "php71-xdebug", args: ['build-from-source']
brew "php@7.2", args: ['with-http2'], link: false
#brew "php72-igbinary", args: ['build-from-source']
#brew "php72-opcache", args: ['build-from-source']
#brew "php72-redis", args: ['build-from-source']
#brew "php72-xdebug", args: ['build-from-source']
brew "phpunit"
brew "pixman"
brew "pkg-config"
brew "pngcrush"
brew "pngquant"
brew "postgresql"
brew "python"
brew "python@2", link: false
brew "rbenv"
brew "re2c"
brew "readline"
brew "redis", restart_service: true
brew "ruby"
brew "ruby-build"
brew "s3cmd"
brew "spdylay"
brew "sqlite"
brew "subversion"
brew "texinfo"
brew "tidy-html5"
brew "tig"
brew "tree"
brew "uchardet"
brew "unibilium"
brew "unixodbc"
brew "vim"
brew "watch"
brew "webp"
brew "wget"
brew "wp-cli"
brew "xz"
brew "yarn"
brew "zlib"